performance-test/results/demo-50/html-report/statistics.json
{
  "관리자 로그인" : {
    "transaction" : "관리자 로그인",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.7030000000000004,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 203.79050336254332,
    "receivedKBytesPerSec" : 160.40541573262686,
    "sentKBytesPerSec" : 47.96241338903607
  },
  "극한 동시성 주문 생성" : {
    "transaction" : "극한 동시성 주문 생성",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.5459999999999994,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 204.66639377814164,
    "receivedKBytesPerSec" : 161.09483729021693,
    "sentKBytesPerSec" : 53.76490227179697
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6244999999999992,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 407.58100672508664,
    "receivedKBytesPerSec" : 320.8108314652537,
    "sentKBytesPerSec" : 101.49722335439168
  }
}